import { Container, Box, Typography, ListItem, List } from "@mui/material";

const ShoppingWays = () => {
  return (
    <Container maxWidth="xl">
      <Box sx={{ pt: "11rem" }}>
        <Typography color="var(--title-color)" variant="h4">
          روش های ارسال
        </Typography>
        <img
          alt="چگونگی ارسال محصول"
          src="https://dashboard.dcakala.com/public/img/cms/001a-koli/send-and-dliver.jpg"
          style={{
            width: "1000px",
            height: "276px",
            display: "flex",
            flexWrap: "wrap",
          }}
        />
        <Typography variant="body1" fontWeight={"bold"} fontSize={20.5} mt={2}>
          همه ی تلاش ما در مجموعه دی سی ای کالا این است که محصول خریداری شده
          توسط مشتری در سریعترین زمان به دست او برسد و از این سو ما سرویس های
          سریع مطابق با نیاز مشتری راه اندازی نموده ایم. در کنار این موضوع ما به
          ارسال اقتصادی و ارزان قیمت نیز فکر کرده ایم تا مشتریانی که اجناس ارزان
          تری خریده اند یا خیلی عجله در دریافت سریع محصول ندارند بتوانند از این
          سیستم استفاده کنند.
        </Typography>
        <Box mt={2} border={"1px solid var(--border-color)"}>
          <List>
            <ListItem>- پیک اختصاصی (برای مناطق 22 گانه شهر تهران)</ListItem>
            <ListItem>- پست پیشتاز (برای سراسر کشور)</ListItem>
            <ListItem>- تیپاکس و چاپار (برای شهرهای تحت پوشش تیپاکس)</ListItem>
            <ListItem>
              - باربری (برای شهرهای تحت پوشش باربری مناسب برای اجناس سنگین)
            </ListItem>
          </List>
        </Box>
        <Typography variant="body1" fontWeight={"bold"} fontSize={20.5} mt={2}>
          همچنین امکان پرداخت در محل برای شهر تهران فعال است و امکان ارسال محصول
          به سراسر کشور وجود دارد.
        </Typography>
        <img
          alt="پیک سریع دی سی ای کالا"
          src="https://dashboard.dcakala.com/public/img/cms/001a-koli/peyk.jpg"
          style={{ width: "600px", height: "600px" }}
        />
      </Box>
      <Box>
        <Typography color="var(--title-color)" variant="h4">
          پیک اختصاصی(مناطق 22 گانه شهر تهران)
        </Typography>
        <Typography
          mt={5}
          variant="body1"
          lineHeight={2}
          fontSize={20.5}
          fontWeight={500}
        >
          سعی ما این است که سفارش‌های شما را در روزهای کاری و به سرعت و در همان
          روز تحویل دهیم. برخی از محصولات سایت دارای قابلیت ارسال فوری هستند که
          تنها ظرف 3 ساعت پس از ثبت سفارش به دست خریدار خواهند رسید. زمان ثبت
          این سفارشات از ساعت 9 صبح تا 4 بعد از ظهر روزهای شنبه تا چهارشنبه و
          روز پنج شنبه ساعت 9 تا 12 است. اما در ارسال های اختصاصی سفارش هایی که
          تا ساعت 12 روزهای شنبه تا چهارشنبه ثبت گردند در همان روز ارسال می شوند
          و سفارش هایی که روز پنج شنبه و جمعه ثبت شوند در روز شنبه ارسال
          میگردند. همچنین ارسال سفارش های ثبت شده در روزهای تعطیل در اولین روز
          کاری پس از تعطیلات انجام می پذیرد.
        </Typography>
        <Typography
          mt={6}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          موارد قابل توجه :
        </Typography>
        <Typography
          mt={5}
          variant="body1"
          lineHeight={2}
          fontSize={20.5}
          fontWeight={500}
        >
          در صورتی که بعد از ثبت سفارش، آدرستان را تغییر دهید ممکن است سفارش شما
          با نهایتا ۴۸ ساعت تاخیر ارسال گردد. هزینه ارسال سفارشات فوری و اختصاصی
          با توجه به منطقه سفارش دهنده متغیر است و اجناس با الوپیک یا اسنپ باکس
          ارسال خواهد شد.
        </Typography>
        <img
          alt="ارسال اقتصادی"
          src="https://dashboard.dcakala.com/public/img/cms/001a-koli/post.jpg"
          style={{ width: "600px", height: "600px" }}
        ></img>
      </Box>
      <Box>
        <Typography
          mt={6}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          ارسال اقتصادی و به صرفه ( برای سراسر کشور)
        </Typography>
        <Typography
          mt={2}
          variant="body1"
          lineHeight={1.7}
          fontSize={20.5}
          fontWeight={500}
        >
          بسیاری از کالاهای دی سی ای کالا به مانند ریموت، فلاشر و … کوچکند و
          ارزش ریالی کمی دارند. برخی از خریداران نیز عجله ای بابت دریافت
          محصولشان ندارند. از این سو دی سی ای کالا روشی اقتصادی و ارزان قیمت
          برای ارسال ها ابداع نمود که برای این افراد بسیار مناسب است. در روش دی
          سی ای کالا مقرون به صرفه ترین حامل را یافته تا مصرف کننده هزینه ی ثابت
          و کمی بابت دریافت کالایش بپردازد.
        </Typography>
        <Typography mt={5} variant="h6">
          موارد قابل توجه :
        </Typography>
        <Box
          mt={2}
          padding={"10px 0"}
          fontWeight={"600"}
          border={"1px solid var(--border-color)"}
        >
          <List>
            <ListItem>
              هزینه ارسال به روش اقتصادی مبلغ ثابت 25000 تومان برای سراسر ایران
              می باشد.
            </ListItem>
            <ListItem>
              این روش صرفا برای کالاهای سبک قابل استفاده است و برای اجناسی نظیر
              جک و موتور پارکینگی، کرکره برقی و موتور کرکره، راهبند، درب و
              اپراتور شیشه ای و دیگر اجناس سنگین حذف خواهد شد.
            </ListItem>
          </List>
        </Box>
        <img
          alt="باربری"
          src="https://dashboard.dcakala.com/public/img/cms/001a-koli/barbary.jpg"
          style={{ width: "600px", height: "600px" }}
        ></img>
      </Box>
      <Box>
        <Typography
          mt={3}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          ارسال با باربری (سراسر ایران)
        </Typography>
        <Typography
          mt={2}
          variant="body1"
          lineHeight={1.7}
          fontSize={20.5}
          fontWeight={500}
        >
          باربری ها حامل هایی مطمئن هستند که در اکثر شهرهای ایران شعبه هایی
          دارند. ما این حامل را برای اجناس سنگین پیشنهاد می کنیم. اما حداقل
          اندازه جنسی که باربری ها می پذیرند ابعاد 30x30x20 می باشد. سفارش هایی
          که تا ساعت 15 شنبه تا چهارشنبه ثبت گردند، همان روز به باربری تحویل می
          شوند( منوط بر این که آن جنس جزو کالا های ارسال سریع باشد) و سفارش های
          ثبت شده تا ساعت 11 روز پنج شنبه نیز در همان روز تحویل باربری می گردند.
          <br />
          <br />
          هزینه ارسال باربری شامل دو بخش هزینه ارسال درون شهری و بین شهری می شود
          که این هزینه با توجه به مقصد متفاوت است. این هزینه پس کرایه شده و در
          مقصد از خریدار دریافت می گردد.
        </Typography>
        <Typography
          mt={3}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          تیپاکس (برای سراسر کشور)
        </Typography>
        <Typography
          mt={2}
          variant="body1"
          lineHeight={1.7}
          fontSize={20.5}
          fontWeight={500}
        >
          تیپاکس و چاپار دو سرویس حمل سریع در کشور است که در ۵۵۰ شهر ایران دارای
          نمایندگی بوده و با توجه به ارسال مستقیم به اکثر این شهرها روشی سریع
          جهت ارسال مرسوله به حساب می‌آید. در روزهای کاری، چنانچه تا ساعت 14 (
          پنج شنبه ها تا ساعت ۰۹:۰۰) سفارش خود را نهایی کنید، سفارش شما همان روز
          تحویل تیپاکس یا چاپار خواهد شد.
          <br />
          <br />
          کد پیگیری مرسوله در قسمت جزئیات سفارش در حساب کاربری شما درج می‌شود.
          همچنین کد پیگیری مرسوله از طریق پیامک نیز به دست شما خواهد رسید. با
          استفاده از کد پیگیری تیپاکس می‌توانید وضعیت مرسوله خود را از سامانه
          رهگیری تیپاکس و سامانه رهگیری چاپار پیگیری نمایید.
          <br />
          <br />
          موارد قابل توجه:
          <br />
          <br />
          قبل انتخاب تیپاکس یا چاپار مطمئن شوید که شهر شما در فهرست شهرهای تحت
          پوشش این دو سرویس هستند.
          <br />
          <br />
          شهرهای تحت پوشش تیپاکس,شهرهای تحت پوشش چاپار هزینه ارسال با تیپاکس و
          چاپار به روش پس کرایه است که با توجه به مسافت متغیر می باشد.
        </Typography>
        <Typography
          mt={3}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          ارسال توسط پست پیشتاز (برای سراسر کشور)
        </Typography>
        <Typography
          mt={2}
          variant="body1"
          lineHeight={1.7}
          fontSize={20.5}
          fontWeight={500}
        >
          سفارش های ثبت شده به روش پستی در روز کاری بعد تحویل مرکز پست خواهد شد.
          همچنین در هنگام ثبت سفارش می‌توانید زمان و ساعتی که سفارش شما تحویل
          شرکت پست می‌شود را مشاهده فرمایید.
          <br />
          <br />
          کد پیگیری مرسوله در قسمت جزئیات سفارش در حساب کاربری شما درج می‌شود.
          همچنین کد پیگیری مرسوله از طریق پیامک نیز به دست شما خواهد رسید. با
          استفاده از کد پیگیری پست پیشتاز می‌توانید وضعیت مرسوله خود را از
          سامانه رهگیری مرسولات پستی پیگیری نمایید.
        </Typography>
        <Typography
          mt={3}
          variant="h5"
          color="var(--theme-color)"
          fontWeight={"bold"}
        >
          چگونگی پیگیری مرسولات
        </Typography>
        <Typography
          mt={2}
          variant="body1"
          lineHeight={1.7}
          fontSize={20.5}
          fontWeight={500}
        >
          پس از ثبت سفارش مراحل مربوط به تکمیل و ارسال سفارش به صورت پیامکی
          ارسال و در حساب کاربری مشتری قابل مشاهده است. پس از تحویل جنس به حامل
          پیامک مربوط به نوع حامل و شماره پیگیری برای مشتری ارسال میگردد که پس
          از آن مشتری می تواند به سامانه پیگیری حامل ها وارد و پس از وارد کردن
          شماره پیگیره محل دقیق مرسوله خود را مشاهده کند.
        </Typography>
      </Box>
    </Container>
  );
};

export default ShoppingWays;
